[
 {
   "FIELD1": 0,
   "Title": "Miso-Butter Roast Chicken With Acorn Squash Panzanella",
   "Ingredients": "['1 (3½–4-lb.) whole chicken', '2¾ tsp. kosher salt, divided, plus more', '2 small acorn squash (about 3 lb. total)', '2 Tbsp. finely chopped sage', '1 Tbsp. finely chopped rosemary', '6 Tbsp. unsalted butter, melted, plus 3 Tbsp. room temperature', '¼ tsp. ground allspice', 'Pinch of crushed red pepper flakes', 'Freshly ground black pepper', '⅓ loaf good-quality sturdy white bread, torn into 1\" pieces (about 2½ cups)', '2 medium apples (such as Gala or Pink Lady; about 14 oz. total), cored, cut into 1\" pieces', '2 Tbsp. extra-virgin olive oil', '½ small red onion, thinly sliced', '3 Tbsp. apple cider vinegar', '1 Tbsp. white miso', '¼ cup all-purpose flour', '2 Tbsp. unsalted butter, room temperature', '¼ cup dry white wine', '2 cups unsalted chicken broth', '2 tsp. white miso', 'Kosher salt, freshly ground pepper']",
   "Instructions": "\"Pat chicken dry with paper towels, season all over with 2 tsp. salt, and tie legs together with kitchen twine. Let sit at room temperature 1 hour.\nMeanwhile, halve squash and scoop out seeds. Run a vegetable peeler along ridges of squash halves to remove skin. Cut each half into ½\"-thick wedges; arrange on a rimmed baking sheet.\nCombine sage, rosemary, and 6 Tbsp. melted butter in a large bowl; pour half of mixture over squash on baking sheet. Sprinkle squash with allspice, red pepper flakes, and ½ tsp. salt and season with black pepper; toss to coat.\nAdd bread, apples, oil, and ¼ tsp. salt to remaining herb butter in bowl; season with black pepper and toss to combine. Set aside.\nPlace onion and vinegar in a small bowl; season with salt and toss to coat. Let sit, tossing occasionally, until ready to serve.\nPlace a rack in middle and lower third of oven; preheat to 425°F. Mix miso and 3 Tbsp. room-temperature butter in a small bowl until smooth. Pat chicken dry with paper towels, then rub or brush all over with miso butter. Place chicken in a large cast-iron skillet and roast on middle rack until an instant-read thermometer inserted into the thickest part of breast registers 155°F, 50–60 minutes. (Temperature will climb to 165°F while chicken rests.) Let chicken rest in skillet at least 5 minutes, then transfer to a plate; reserve skillet.\nMeanwhile, roast squash on lower rack until mostly tender, about 25 minutes. Remove from oven and scatter reserved bread mixture over, spreading into as even a layer as you can manage. Return to oven and roast until bread is golden brown and crisp and apples are tender, about 15 minutes. Remove from oven, drain pickled onions, and toss to combine. Transfer to a serving dish.\nUsing your fingers, mash flour and butter in a small bowl to combine.\nSet reserved skillet with chicken drippings over medium heat. You should have about ¼ cup, but a little over or under is all good. (If you have significantly more, drain off and set excess aside.) Add wine and cook, stirring often and scraping up any browned bits with a wooden spoon, until bits are loosened and wine is reduced by about half (you should be able to smell the wine), about 2 minutes. Add butter mixture; cook, stirring often, until a smooth paste forms, about 2 minutes. Add broth and any reserved drippings and cook, stirring constantly, until combined and thickened, 6–8 minutes. Remove from heat and stir in miso. Taste and season with salt and black pepper.\nServe chicken with gravy and squash panzanella alongside.\"",
   "Image_Name": "miso-butter-roast-chicken-acorn-squash-panzanella",
   "Cleaned_Ingredients": "['1 (3½–4-lb.) whole chicken', '2¾ tsp. kosher salt, divided, plus more', '2 small acorn squash (about 3 lb. total)', '2 Tbsp. finely chopped sage', '1 Tbsp. finely chopped rosemary', '6 Tbsp. unsalted butter, melted, plus 3 Tbsp. room temperature', '¼ tsp. ground allspice', 'Pinch of crushed red pepper flakes', 'Freshly ground black pepper', '⅓ loaf good-quality sturdy white bread, torn into 1\" pieces (about 2½ cups)', '2 medium apples (such as Gala or Pink Lady; about 14 oz. total), cored, cut into 1\" pieces', '2 Tbsp. extra-virgin olive oil', '½ small red onion, thinly sliced', '3 Tbsp. apple cider vinegar', '1 Tbsp. white miso', '¼ cup all-purpose flour', '2 Tbsp. unsalted butter, room temperature', '¼ cup dry white wine', '2 cups unsalted chicken broth', '2 tsp. white miso', 'Kosher salt', 'freshly ground pepper']",
   "Preprocessed_Data_Ingredients": "['chicken', 'kosher', 'salt', 'acorn', 'squash', 'sage', 'rosemary', 'unsalted', 'butter', 'melted', 'room', 'temperature', 'ground', 'allspice', 'pinch', 'red', 'pepper', 'flakes', 'ground', 'black', 'pepper', 'goodquality', 'sturdy', 'white', 'bread', 'torn', 'apples', 'gala', 'pink', 'lady', 'cored', 'extravirgin', 'olive', 'oil', 'red', 'onion', 'apple', 'cider', 'vinegar', 'white', 'miso', 'allpurpose', 'flour', 'unsalted', 'butter', 'room', 'temperature', 'dry', 'white', 'wine', 'unsalted', 'chicken', 'broth', 'white', 'miso', 'kosher', 'salt', 'ground', 'pepper']"
 },
 {
   "FIELD1": 10,
   "Title": "Hot Pimento Cheese Dip",
   "Ingredients": "['1 (7 oz./200 g) can chipotle in adobo sauce', '½ garlic clove, minced', 'Kosher salt', '1½ tsp. cornstarch', '1 (5 fl oz./150 ml) can evaporated milk (about ½ cup plus 2 Tbsp)', '8 oz. (230 g) sharp or extra-sharp Cheddar cheese, coarsely grated (about 2 cups)', '2 oz. (55 g) cream cheese, roughly diced, at room temperature', '¼ cup (60 g) mayonnaise', '1 (4 oz./115 g) jar diced pimento peppers, drained', '1½ tsp. Chipotle Pepper Purée']",
   "Instructions": "\"Put the chipotle peppers and adobo sauce in a small food processor or blender and blend until the mixture turns into a smooth purée. Set aside. The chipotle purée can be made in advance, stored in an airtight container, and refrigerated for up to 2 months.\nOn a cutting board, sprinkle the garlic with a large pinch of salt and gather it into a small mound. Holding the blunt side of the knife with both hands, press and scrape the knife’s sharp end, holding it at a slight angle, across the garlic mound to flatten it. Repeat, dragging it across the garlic, until you have a smooth paste. Set aside.\nIn a small bowl, mix the cornstarch and 1½ tsp. of the evaporated milk into a slurry. Pour the rest of the evaporated milk into a medium saucepan and stir in the slurry. Bring to a boil over medium-high heat, whisking constantly. Turn the heat to low and add the Cheddar gradually by the handful, stirring until the Cheddar is melted and the mixture is smooth. Add the cream cheese and whisk until it melts. Stir in the mayonnaise, pimento peppers, 1½ tsp. of the chipotle purée, and the garlic paste. Season with salt. Transfer to a serving bowl or keep it warm in a slow cooker and serve immediately.\nTo reheat the sauce, microwave it, stirring every 30 seconds, until fully melted.\"",
   "Image_Name": "hot-pimento-cheese-dip-polina-chesnakova",
   "Cleaned_Ingredients": "['1 (7 oz./200 g) can chipotle in adobo sauce', '½ garlic clove, minced', 'Kosher salt', '1½ tsp. cornstarch', '1 (5 fl oz./150 ml) can evaporated milk (about ½ cup plus 2 Tbsp)', '8 oz. (230 g) sharp or extra-sharp Cheddar cheese, coarsely grated (about 2 cups)', '2 oz. (55 g) cream cheese, roughly diced, at room temperature', '¼ cup (60 g) mayonnaise', '1 (4 oz./115 g) jar diced pimento peppers, drained', '1½ tsp. Chipotle Pepper Purée']",
   "Preprocessed_Data_Ingredients": "['chipotle', 'adobo', 'garlic', 'clove', 'kosher', 'salt', 'cornstarch', 'evaporated', 'milk', 'sharp', 'extrasharp', 'cheddar', 'cheese', 'coarsely', 'cream', 'cheese', 'room', 'temperature', 'mayonnaise', 'pimento', 'peppers', 'drained', 'chipotle', 'pepper', 'purée']"
 },
 {
   "FIELD1": 13,
   "Title": "Caesar Salad Roast Chicken",
   "Ingredients": "['8 anchovies, mashed to a paste', '8 garlic cloves, finely grated', '6 Tbsp. mayonnaise, divided', '1 Tbsp. Dijon mustard, plus more for serving', '2 Tbsp. extra-virgin olive oil, divided', '1½ tsp. freshly ground black pepper, plus more', '1 (3½–4-lb.) whole chicken or 4 chicken legs (thigh and drumstick; about 3 lb.)', 'Kosher salt', '8 medium shallots, unpeeled, halved lengthwise', '2 lemons, divided', '1 oz. Parmesan, finely grated', '4 oz. country-style bread, torn into (1½\") pieces', '2 romaine hearts, leaves separated, torn']",
   "Instructions": "\"Place a rack in lower third of oven; preheat to 450°F. Whisk anchovies, garlic, 3 Tbsp. mayonnaise, 1 Tbsp. mustard, 1 Tbsp. oil, and 1½ tsp. pepper in a small bowl. Set aside 1 Tbsp. anchovy mayo in another small bowl.\nPat chicken dry; season outside and inside all over with salt. Arrange breast side up in a cast-iron skillet and tuck wings underneath. Arrange shallots around (if using legs, nestle under and around); season with salt and pepper. Brush remaining anchovy mayo all over chicken, making sure to get it into the nooks and crannies, then brush shallots with any leftover anchovy mayo.\nPlace chicken in oven so legs are facing toward the back (this is the hottest part of the oven and will help the legs cook before the breast dries out) and roast until some anchovy mayo and fat begin to drip onto shallots, about 15 minutes. Remove from oven and, using tongs, turn shallots to coat in drippings. Return skillet to oven and continue to roast chicken, stirring shallots once or twice, until golden brown and an instant-read thermometer inserted into the thickest part of breast registers 155°F, 45–55 minutes. If skin starts to get too dark on the top before chicken is done, tent area with foil, leaving the rest of the bird exposed. If using chicken legs, start checking at 40 minutes (a thermometer inserted right at the joint should register 160°F). Transfer chicken and shallots to a cutting board, leaving behind any juices and fat in skillet. If shallots need more time to soften and darken, roast a bit longer without chicken before proceeding. Reserve skillet.\nReduce oven temperature to 400°F. Finely grate half of zest of 1 lemon into a large bowl; cut lemon in half and squeeze in juice. Add reserved 1 Tbsp. anchovy mayo, remaining 3 Tbsp. mayo, and remaining 1 Tbsp. oil and whisk to combine, then stir in Parmesan. Season with salt and pepper. Set dressing aside.\nAdd bread to reserved skillet with fat and turn to coat. Return skillet to oven and toast bread, tossing halfway through, until golden brown and crisp, 12–15 minutes. Transfer croutons to bowl with reserved dressing. Add romaine and gently toss until lettuce is well coated. Season salad with salt and pepper.\nSlice remaining lemon into wedges. Carve chicken and nestle back into skillet or transfer to a platter; arrange shallots and lemon wedges around. Serve with salad and more mustard alongside.\"",
   "Image_Name": "caesar-salad-roast-chicken",
   "Cleaned_Ingredients": "['8 anchovies, mashed to a paste', '8 garlic cloves, finely grated', '6 Tbsp. mayonnaise, divided', '1 Tbsp. Dijon mustard, plus more for serving', '2 Tbsp. extra-virgin olive oil, divided', '1½ tsp. freshly ground black pepper, plus more', '1 (3½–4-lb.) whole chicken or 4 chicken legs (thigh and drumstick; about 3 lb.)', 'Kosher salt', '8 medium shallots, unpeeled, halved lengthwise', '2 lemons, divided', '1 oz. Parmesan, finely grated', '4 oz. country-style bread, torn into (1½\") pieces', '2 romaine hearts', 'leaves separated', 'torn']",
   "Preprocessed_Data_Ingredients": "['anchovies', 'mashed', 'paste', 'garlic', 'mayonnaise', 'dijon', 'mustard', 'extravirgin', 'olive', 'oil', 'ground', 'black', 'pepper', 'chicken', 'chicken', 'legs', 'thigh', 'drumstick', 'kosher', 'salt', 'shallots', 'unpeeled', 'lengthwise', 'lemons', 'parmesan', 'countrystyle', 'bread', 'torn', 'romaine', 'hearts', 'leaves', 'separated', 'torn']"
 },
 
 {
   "FIELD1": 3210,
   "Title": "Spinach Ohitashi",
   "Ingredients": "['1 cup Dashi', '1/4 cup soy sauce', '2 tablespoons mirin (sweet Japanese rice wine)', '1 bunch mature spinach, trimmed', 'Kosher salt', 'Bonito flakes (for serving)']",
   "Instructions": "\"Combine dashi, soy sauce, and mirin in a small bowl.\nCook spinach in a large pot of boiling salted water just until wilted and bright green, a matter of seconds. Drain and transfer to a large bowl of lightly salted ice water; let cool. Drain and squeeze out excess liquid from greens. Pack into a cylinder shape. Cut in half crosswise or into bite-size lengths.\nTo serve, divide greens among bowls and top with broth. Scatter bonito flakes over top.\"",
   "Image_Name": "spinach-ohitashi",
   "Cleaned_Ingredients": "['1 cup Dashi', '1/4 cup soy sauce', '2 tablespoons mirin (sweet Japanese rice wine)', '1 bunch mature spinach, trimmed', 'Kosher salt', 'Bonito flakes (for serving)']",
   "Preprocessed_Data_Ingredients": "['dashi', 'soy', 'mirin', 'sweet', 'japanese', 'rice', 'wine', 'bunch', 'mature', 'spinach', 'trimmed', 'kosher', 'salt', 'bonito', 'flakes']"
 },
 {
   "FIELD1": 3213,
   "Title": "Salmon Teriyaki",
   "Ingredients": "['1/2 cup sake', '1/4 cup mirin (sweet Japanese rice wine)', '1/4 cup soy sauce', '1 tablespoon vegetable oil, plus more if needed', '4 (6-ounce) skin-on, boneless salmon fillets (about 1 inch thick)', 'Kosher salt', 'Sansho powder (for serving; optional)', 'Sansho powder is made from the ground berries of the prickly ash tree.']",
   "Instructions": "\"Combine sake, mirin, and soy sauce in a small bowl; set teriyaki sauce aside.\nHeat oil in a large skillet over medium-high. Season salmon lightly with salt. Cook, skin side down, until skin is brown and crisp, about 4 minutes. Turn and cook until other side is just beginning to brown, about 2 minutes. Transfer to a plate.\nPour off fat in skillet. Bring teriyaki sauce to a boil in skillet over medium heat. Cook until reduced by two-thirds, about 4 minutes. Add salmon, skin side up, and cook, spooning sauce over, until sauce is syrupy and salmon is just cooked through, about 2 minutes.\nServe sprinkled with sansho powder, if desired.\"",
   "Image_Name": "salmon-teriyaki",
   "Cleaned_Ingredients": "['1/2 cup sake', '1/4 cup mirin (sweet Japanese rice wine)', '1/4 cup soy sauce', '1 tablespoon vegetable oil, plus more if needed', '4 (6-ounce) skin-on, boneless salmon fillets (about 1 inch thick)', 'Kosher salt', 'Sansho powder (for serving; optional)', 'Sansho powder is made from the ground berries of the prickly ash tree.']",
   "Preprocessed_Data_Ingredients": "['sake', 'mirin', 'sweet', 'japanese', 'rice', 'wine', 'soy', 'vegetable', 'oil', 'needed', 'skinon', 'boneless', 'salmon', 'fillets', 'thick', 'kosher', 'salt', 'sansho', 'powder', 'sansho', 'powder', 'is', 'made', 'from', 'ground', 'berries', 'prickly', 'ash', 'tree']"
 }, {
   "FIELD1": 3215,
   "Title": "Salted Red Cabbage",
   "Ingredients": "['1 teaspoon fennel seeds', '1/2 small red cabbage, core removed, leaves cut into 1-inch pieces', '2 tablespoons kosher salt, plus more', '3 tablespoons apple cider vinegar', '3 tablespoons olive oil', 'Pinch of sugar', 'Freshly ground black pepper']",
   "Instructions": "\"Toast fennel seeds in a dry small skillet over medium-low, tossing, until fragrant, about 2 minutes; transfer to a small bowl.\nToss cabbage and 2 Tbsp. salt in a large bowl. Massage vigorously until cabbage begins to release water and soften, about 2 minutes. Rinse in cold water until no longer too salty; squeeze out excess liquid and pat dry. Toss in a large bowl with vinegar, oil, sugar, and fennel seeds. Season with pepper.\nCabbage can be made 5 days ahead. Cover and chill.\"",
   "Image_Name": "salted-red-cabbage",
   "Cleaned_Ingredients": "['1 teaspoon fennel seeds', '1/2 small red cabbage, core removed, leaves cut into 1-inch pieces', '2 tablespoons kosher salt, plus more', '3 tablespoons apple cider vinegar', '3 tablespoons olive oil', 'Pinch of sugar', 'Freshly ground black pepper']",
   "Preprocessed_Data_Ingredients": "['fennel', 'seeds', 'red', 'cabbage', 'core', 'removed', 'leaves', 'kosher', 'salt', 'apple', 'cider', 'vinegar', 'olive', 'oil', 'pinch', 'sugar', 'ground', 'black', 'pepper']"
 },

 {
   "FIELD1": 3217,
   "Title": "Real-Deal Aioli",
   "Ingredients": "['1 large egg yolk', '4 medium garlic cloves, finely grated', '1/2 teaspoon kosher salt', '1/2 cup olive oil']",
   "Instructions": "\"Whisk egg yolk, garlic, and salt in a medium bowl to combine. Mix in 1 tsp. water. Whisking constantly, add oil, drop by drop at first, then 1/8-teaspoonful at a time as mixture emulsifies and thickens. (Do not add oil too quickly or aioli will break and oil will separate.) Whisk until oil is incorporated and aioli is stiff enough to hold its shape when spooned.\nAioli can be made 1 day ahead. Cover and chill.\"",
   "Image_Name": "real-deal-aioli",
   "Cleaned_Ingredients": "['1 large egg yolk', '4 medium garlic cloves, finely grated', '1/2 teaspoon kosher salt', '1/2 cup olive oil']",
   "Preprocessed_Data_Ingredients": "['egg', 'yolk', 'garlic', 'kosher', 'salt', 'olive', 'oil']"
 },
 {
   "FIELD1": 3221,
   "Title": "Dashi",
   "Ingredients": "['2 (6x5-inch) pieces dried kombu', '1 1/2 ounces bonito flakes (about 3 packed cups)']",
   "Instructions": "\"Combine kombu and 8 cups water in a large saucepan. Let sit until kombu softens, 25–35 minutes. Bring to a boil over medium heat. Immediately remove from heat; fish out kombu and discard.\nAdd a splash of water to pot to cool liquid slightly. Add bonito flakes and stir once to submerge them. Return to a gentle boil, reduce heat, and simmer gently, skimming off any foam, 5 minutes. Let steep off heat, 15 minutes.\nStrain dashi through a fine-mesh sieve or cheesecloth-lined colander into a medium bowl; do not press on solids.\nDashi can be made 2 days ahead. Let cool; cover and chill.\"",
   "Image_Name": "dashi",
   "Cleaned_Ingredients": "['2 (6x5-inch) pieces dried kombu', '1 1/2 ounces bonito flakes (about 3 packed cups)']",
   "Preprocessed_Data_Ingredients": "['xinch', 'dried', 'kombu', 'bonito', 'flakes']"
 },
 {
   "FIELD1": 3222,
   "Title": "Toasted Garlic-Beef Stock",
   "Ingredients": "['4 pounds beef bones', '1/2 bunch celery, coarsely chopped', '1 medium onion, coarsely chopped', '4 medium carrots, scrubbed, coarsely chopped', '1 tablespoon tomato paste', '1/2 cup olive oil', '1 head of garlic, cloves thinly sliced', '1 bunch herb stems (such as parsley, cilantro, and/or thyme)', '4 bay leaves', '1/2 teaspoon black peppercorns', '1/2 teaspoon coriander seeds']",
   "Instructions": "\"Preheat oven to 450°F. Roast bones on a parchment-lined rimmed baking sheet 30 minutes. Arrange celery, onion, and carrots on sheet; roast 10 minutes. Spread tomato paste over bones and vegetables and roast 5 minutes more; let cool.\nMeanwhile, heat oil in a small saucepan over medium and cook garlic, shaking pan occasionally, until golden, about 5 minutes. Immediately strain oil through a fine-mesh sieve into a bowl; set aside garlic. Set aside oil for Ditalini Risotto and other uses.\nTransfer bones and vegetables to a large pot; pour in cold water to cover. Add herb stems, bay leaves, peppercorns, coriander seeds, and reserved garlic. Bring to a boil over medium heat. Reduce heat to low and simmer, skimming fat and foam from surface, until caramel colored and flavorful, about 3 hours. Strain stock through a fine-mesh sieve into a large bowl, pressing on solids; discard solids.\nStock can be made 3 days ahead. Let cool; cover and chill, or freeze up to 3 months.\"",
   "Image_Name": "toasted-garlic-beef-stock",
   "Cleaned_Ingredients": "['4 pounds beef bones', '1/2 bunch celery, coarsely chopped', '1 medium onion, coarsely chopped', '4 medium carrots, scrubbed, coarsely chopped', '1 tablespoon tomato paste', '1/2 cup olive oil', '1 head of garlic, cloves thinly sliced', '1 bunch herb stems (such as parsley, cilantro, and/or thyme)', '4 bay leaves', '1/2 teaspoon black peppercorns', '1/2 teaspoon coriander seeds']",
   "Preprocessed_Data_Ingredients": "['beef', 'bones', 'bunch', 'celery', 'coarsely', 'onion', 'coarsely', 'carrots', 'scrubbed', 'coarsely', 'tomato', 'paste', 'olive', 'oil', 'head', 'garlic', 'bunch', 'herb', 'stems', 'parsley', 'cilantro', 'andor', 'thyme', 'bay', 'leaves', 'black', 'peppercorns', 'coriander', 'seeds']"
 },
 {
   "FIELD1": 3223,
   "Title": "Coconut-Clam Stock",
   "Ingredients": "['1 tablespoon virgin coconut oil or vegetable oil', '1 medium onion, coarsely chopped', '1 fennel bulb, trimmed, coarsely chopped', '1 lemongrass stalk, tough outer layers removed, lightly smashed, coarsely chopped', '2 bay leaves', '6 cherrystone or other large hard-shell clams, scrubbed', '1 cup dry white wine', '1 (13.5-ounce can) unsweetened coconut milk', 'Kosher salt']",
   "Instructions": "\"Heat oil in a large pot over medium-low. Add onion, fennel, lemongrass, and bay leaves. Cover and cook, checking and stirring halfway through to ensure no browning occurs, until softened, 8–10 minutes. (The flavor won't be ruined if the vegetables take on color, but the stock will end up grayish.)\nAdd clams and wine and increase heat to medium-high. Cover and cook until clams open, 12–15 minutes. Add coconut milk and 1 cup water. Bring to a boil, then reduce heat and simmer 15 minutes.\nStrain stock through a fine-mesh sieve into a large bowl, pressing on solids; discard solids. Season stock with salt. Blend with an immersion blender until smooth and emulsified, if desired.\"",
   "Image_Name": "coconut-clam-stock",
   "Cleaned_Ingredients": "['1 tablespoon virgin coconut oil or vegetable oil', '1 medium onion, coarsely chopped', '1 fennel bulb, trimmed, coarsely chopped', '1 lemongrass stalk, tough outer layers removed, lightly smashed, coarsely chopped', '2 bay leaves', '6 cherrystone or other large hard-shell clams, scrubbed', '1 cup dry white wine', '1 (13.5-ounce can) unsweetened coconut milk', 'Kosher salt']",
   "Preprocessed_Data_Ingredients": "['virgin', 'coconut', 'oil', 'vegetable', 'oil', 'onion', 'coarsely', 'fennel', 'bulb', 'trimmed', 'coarsely', 'lemongrass', 'stalk', 'tough', 'outer', 'layers', 'removed', 'lightly', 'smashed', 'coarsely', 'bay', 'leaves', 'cherrystone', 'other', 'hardshell', 'clams', 'scrubbed', 'dry', 'white', 'wine', 'unsweetened', 'coconut', 'milk', 'kosher', 'salt']"
 },
 {
   "FIELD1": 3233,
   "Title": "French Spiced Bread",
   "Ingredients": "['2 tablespoons melted unsalted butter', '1/2 cup whole almonds', '1/2 cup store-bought or homemade candied orange peel', '1/2 cup dried apricots', '1/2 cup dried plums', '2 cups honey', '1 1/4 cups whole milk', '2 teaspoons kosher salt', '6 (3\") cinnamon sticks', '3 star anise pods', '3 cups all-purpose flour', '1 tablespoon plus 1 teaspoon baking powder', '1 tablespoon plus 1 teaspoon Reims N.39 spice mix', '2 teaspoons baking soda', '2 large eggs', '2 (9x5\") loaf pans']",
   "Instructions": "\"Preheat oven to 325°F. Grease loaf pans with melted butter.\nToast almonds on a rimmed baking sheet, tossing once or twice, until golden brown and fragrant, 6–8 minutes. Coarsely chop zest, apricots, plums, and toasted almonds. Transfer to a small bowl.\nBring honey, milk, salt, cinnamon, and star anise to a boil in a medium saucepan over medium heat. Meanwhile, whisk flour, baking powder, spice mix, and baking soda in a large bowl.\nStrain honey mixture through a fine-mesh sieve into dry ingredients and whisk to combine. Add eggs and whisk until incorporated. Using a spatula, quickly fold in zest mixture.\nDivide dough between prepared pans, filling each about three-quarters full. Bake bread until tops are golden brown and a toothpick inserted into the centers comes out clean, 35–40 minutes.\nLet bread cool 10 minutes in pan, then carefully remove from pan and transfer to a wire rack.\nBread can be made 5 days ahead. Tightly wrap and store at room temperature, or freeze up to 1 month.\"",
   "Image_Name": "french-spiced-bread",
   "Cleaned_Ingredients": "['2 tablespoons melted unsalted butter', '1/2 cup whole almonds', '1/2 cup store-bought or homemade candied orange peel', '1/2 cup dried apricots', '1/2 cup dried plums', '2 cups honey', '1 1/4 cups whole milk', '2 teaspoons kosher salt', '6 (3\") cinnamon sticks', '3 star anise pods', '3 cups all-purpose flour', '1 tablespoon plus 1 teaspoon baking powder', '1 tablespoon plus 1 teaspoon Reims N.39 spice mix', '2 teaspoons baking soda', '2 large eggs', '2 (9x5\") loaf pans']",
   "Preprocessed_Data_Ingredients": "['melted', 'unsalted', 'butter', 'almonds', 'storebought', 'homemade', 'candied', 'orange', 'peel', 'dried', 'apricots', 'dried', 'plums', 'honey', 'milk', 'kosher', 'salt', 'cinnamon', 'sticks', 'star', 'anise', 'pods', 'allpurpose', 'flour', 'baking', 'powder', 'reims', 'n', 'spice', 'baking', 'soda', 'eggs', 'x', 'pans']"
 },
 {
   "FIELD1": 3234,
   "Title": "Hot White Russian",
   "Ingredients": "['2 1/2 cups freshly brewed coffee', '1/2 cup heavy cream', '1/2 cup Kahlúa or other coffee-flavored liqueur, or to taste', '1/4 cup vodka, or to taste', 'whipped heavy cream for garnish if desired']",
   "Instructions": "\"In a saucepan stir together the coffee, the 1/2 cup cream, the Kahlúa, and the vodka and heat the mixture over moderate heat until it is hot. Divide the mixture among heated mugs and garnish each drink with some of the whipped cream.\"",
   "Image_Name": "hot-white-russian-200621",
   "Cleaned_Ingredients": "['2 1/2 cups freshly brewed coffee', '1/2 cup heavy cream', '1/2 cup Kahlúa or other coffee-flavored liqueur, or to taste', '1/4 cup vodka, or to taste', 'whipped heavy cream for garnish if desired']",
   "Preprocessed_Data_Ingredients": "['brewed', 'coffee', 'heavy', 'cream', 'kahlúa', 'other', 'coffeeflavored', 'liqueur', 'taste', 'vodka', 'taste', 'whipped', 'heavy', 'cream', 'garnish', 'desired']"
 },
 {
   "FIELD1": 3235,
   "Title": "Luxe French Potatoes",
   "Ingredients": "['4 pounds Yukon Gold potatoes, peeled, cut into 1 1/2\" pieces', 'Kosher salt', '4 garlic cloves, forced through a press or finely chopped', '2 cups heavy cream', '1/2 cup (1 stick) unsalted butter', '3/4 teaspoon freshly grated nutmeg', '3/4 teaspoon freshly ground white pepper', '3/4 pound Gruyère, coarsely grated (about 4 cups)', '1/2 pound fresh mozzarella, coarsely grated (about 1 1/2 cups)', 'A 4-quart gratin or casserole dish; a potato ricer or food mill; a pastry bag fitted with a 3/4-inch star tip']",
   "Instructions": "\"Place rack in middle of oven and preheat to 350°F. Place potatoes in a large wide heavy pot. Add 1 1/2 tsp. salt and enough cold water to cover by 2\". Bring to a boil over high heat, then reduce heat to medium-low and simmer until potatoes break apart when pierced with the tip of a knife, 35–40 minutes.\nMeanwhile, cook garlic, cream, and butter in a medium saucepan over medium heat, whisking occasionally, until butter is melted. Whisk in nutmeg, pepper, and 1 Tbsp. plus 1 tsp. salt. Remove from heat.\nDrain potatoes and immediately pass through potato ricer into a large bowl. Stir in cream mixture until smooth.\nReturn half of potato mixture to wide pot; reserve remaining potato mixture in bowl. Add Gruyère and mozzarella and cook over low heat, stirring constantly with a wooden spoon, until cheese is melted and mixture can be stretched with the spoon (like warm mozzarella), about 10 minutes. Transfer to gratin dish; smooth top.\nWorking in batches if needed, spoon reserved potato mixture in bowl into pastry bag fitted with star tip. Pipe very tight rows of 1/2x1/2\" rosettes on potato-cheese mixture in gratin dish. Bake until top is golden brown, about 45 minutes. Let stand 10 minutes before serving.\"",
   "Image_Name": "luxe-french-potatoes",
   "Cleaned_Ingredients": "['4 pounds Yukon Gold potatoes, peeled, cut into 1 1/2\" pieces', 'Kosher salt', '4 garlic cloves, forced through a press or finely chopped', '2 cups heavy cream', '1/2 cup (1 stick) unsalted butter', '3/4 teaspoon freshly grated nutmeg', '3/4 teaspoon freshly ground white pepper', '3/4 pound Gruyère, coarsely grated (about 4 cups)', '1/2 pound fresh mozzarella, coarsely grated (about 1 1/2 cups)', 'A 4-quart gratin or casserole dish; a potato ricer or food mill; a pastry bag fitted with a 3/4-inch star tip']",
   "Preprocessed_Data_Ingredients": "['yukon', 'gold', 'potatoes', 'kosher', 'salt', 'garlic', 'forced', 'through', 'press', 'heavy', 'cream', 'stick', 'unsalted', 'butter', 'nutmeg', 'ground', 'white', 'pepper', 'gruyère', 'coarsely', 'mozzarella', 'coarsely', 'quart', 'gratin', 'casserole', 'dish', 'potato', 'ricer', 'food', 'mill', 'pastry', 'bag', 'fitted', 'with', 'star', 'tip']"
 },
 {
   "FIELD1": 3236,
   "Title": "Sunshine Cake",
   "Ingredients": "['1/2 cup (1 stick) unsalted butter, melted, cooled, plus more for pan', '1/2 cup all-purpose flour, plus more for pan', '2 large eggs', '3/4 cup granulated sugar', '1 teaspoon almond extract', '1/2 teaspoon kosher salt', '1/4 cup sliced almonds', 'Pearl sugar (for sprinkling; optional)', 'A 9-inch pie plate (not deep dish) or tart pan']",
   "Instructions": "\"Preheat oven to 350°F. Butter and flour 9-inch pie plate.\nWhisk eggs, granulated sugar, almond extract, and salt in a large bowl until frothy and pale, about 30 seconds. Add 1/2 cup butter and 1/2 cup flour and stir until incorporated. Pour into prepared pie plate. Top with almonds and pearl sugar, if using.\nBake cake until top is golden brown and a toothpick inserted into the center comes out clean, 20–25 minutes. Transfer pan to a wire rack and let cake cool slightly before serving.\nCake can be made 1 day ahead; store tightly wrapped at room temperature.\"",
   "Image_Name": "sunshine-cake",
   "Cleaned_Ingredients": "['1/2 cup (1 stick) unsalted butter, melted, cooled, plus more for pan', '1/2 cup all-purpose flour, plus more for pan', '2 large eggs', '3/4 cup granulated sugar', '1 teaspoon almond extract', '1/2 teaspoon kosher salt', '1/4 cup sliced almonds', 'Pearl sugar (for sprinkling; optional)', 'A 9-inch pie plate (not deep dish) or tart pan']",
   "Preprocessed_Data_Ingredients": "['stick', 'unsalted', 'butter', 'melted', 'cooled', 'pan', 'allpurpose', 'flour', 'pan', 'eggs', 'granulated', 'sugar', 'almond', 'extract', 'kosher', 'salt', 'almonds', 'pearl', 'sugar', 'sprinkling', 'pie', 'plate', 'not', 'deep', 'dish', 'tart', 'pan']"
 }]
